const bibleList = [{
        bible:"너의 하나님 여호와가 너의 가운데에 계시니 그는 구원을 베푸실 전능자이시라 그가 너로 말미암아 기쁨을 이기지 못하시며 너를 잠잠히 사랑하시며 너로 말미암아 즐거이 부르며 기뻐하시리라 하리라",
        verse:"스바냐 3:17"
    }, {
        bible:"내가 그리스도와 함께 십자가에 못 박혔나니 그런즉 이제는 내가 사는 것이 아니요 오직 내 안에 그리스도께서 사시는 것이라 이제 내가 육체 가운데 사는 것은 나를 사랑하사 나를 위하여 자기 자신을 버리신 하나님의 아들을 믿는 믿음 안에서 사는 것이라",
        verse:"갈라디아서 2:20"
    }, {
        bible:"하나님이 세상을 이처럼 사랑하사 독생자를 주셨으니 이는 그를 믿는 자마다 멸망하지 않고 영생을 얻게 하려 하심이라",
        verse:"요한복음 3:16"
    }, {
        bible:"내가 확신하노니 사망이나 생명이나 천사들이나 권세자들이나 현재 일이나 장래 일이나 능력이나 높음이나 깊음이나 다른 어떤 피조물이라도 우리를 우리 주 그리스도 예수 안에 있는 하나님의 사랑에서 끊을 수 없으리라",
        verse:"로마서 8:38-39"
    }, {
        bible:"그러므로 우리가 여호와를 알자 힘써 여호와를 알자 그의 나타나심은 새벽 빛 같이 어김없나니 비와 같이, 땅을 적시는 늦은 비와 같이 우리에게 임하시리라 하니라",
        verse:"호세아 6:3"
    }, {
        bible:"우리가 아직 죄인 되었을 때에 그리스도께서 우리를 위하여 죽으심으로 하나님께서 우리에 대한 자기의 사랑을 확증하셨느니라",
        verse:"로마서 5:8"
    }, {
        bible:"그러므로 주께서 친히 징조를 너희에게 주실 것이라 보라 처녀가 잉태하여 아들을 낳을 것이요 그의 이름을 임마누엘이라 하리라",
        verse:"이사야 7:14"
    }, {
        bible:"사랑은 여기 있으니 우리가 하나님을 사랑한 것이 아니요 하나님이 우리를 사랑하사 우리 죄를 속하기 위하여 화목제물로 그 아들을 보내셨음이라",
        verse:"요한일서 4:10"
    }, {
        bible:"그런즉 믿음, 소망, 사랑, 이 세 가지는 항상 있을 것인데 그 중의 제일은 사랑이라",
        verse:"고전 13:13"
    }, {
        bible:"십자가의 도가 멸망하는 자들에게는 미련한 것이요 구원을 받는 우리에게는 하나님의 능력이라",
        verse:"고전 1:18"
    }, {
        bible:"오직 성령이 너희에게 임하시면 너희가 권능을 받고 예루살렘과 온 유대와 사마리아와 땅 끝까지 이르러 내 증인이 되리라 하시니라",
        verse:"사도행전 1:8"
    }, {
        bible:"또한 너는 청년의 정욕을 피하고 주를 깨끗한 마음으로 부르는 자들과 함께 의와 믿음과 사랑과 화평을 따르라",
        verse:"디모데후서 2:22"
    }, {
        bible:"그러므로 너희는 가서 모든 민족을 제자로 삼아 아버지와 아들과 성령의 이름으로 세례를 베풀고 내가 너희에게 분부한 모든 것을 가르쳐 지키게 하라 볼지어다 내가 세상 끝날까지 너희와 항상 함께 있으리라 하시니라",
        verse:"마태복음 28:19-20"
    }, {
        bible:"너는 마음을 다하여 여호와를 신뢰하고 네 명철을 의지하지 말라 너는 범사에 그를 인정하라 그리하면 네 길을 지도하시리라",
        verse:"잠언 3:5-6"
    }, {
        bible:"기쁨으로 여호와를 섬기며 노래하면서 그의 앞에 나아갈지어다",
        verse:"시편 100:2"
    }, {
        bible:"내가 사망의 음침한 골짜기로 다닐지라도 해를 두려워하지 않을 것은 주께서 나와 함께 하심이라 주의 지팡이와 막대기가 나를 안위하시나이다",
        verse:"시편 23:4"
    }, {
        bible:"내 아들아 그러므로 너는 그리스도 예수 안에 있는 은혜 가운데서 강하고 또 네가 많은 증인 앞에서 내게 들은 바를 충성된 사람들에게 부탁하라 그들이 또 다른 사람들을 가르칠 수 있으리라",
        verse:"디모데후서 2:1-2"
    }, {
        bible:"시험에 들지 않게 깨어 기도하라 마음에는 원이로되 육신이 약하도다 하시고",
        verse:"마태복음 26:41"
    }, {
        bible:"하나님을 가까이하라 그리하면 너희를 가까이 하시리라 죄인들아 손을 깨끗이 하라 두 마음을 품은 자들아 마음을 성결하게 하라",
        verse:"야고보서 4:"
    }, {
        bible:"이스라엘아 들으라 우리 하나님 여호와는 오직 유일한 여호와이시니 너는 마음을 다하고 뜻을 다하고 힘을 다하여 네 하나님 여호와를 사랑하라",
        verse:"신명기 6:4-5"
    }, {
        bible:"항상 기뻐하라 쉬지 말고 기도하라 범사에 감사하라 이것이 그리스도 예수 안에서 너희를 향하신 하나님의 뜻이니라",
        verse:"데살로니가전서 5:16-18"
    }, {
        bible:"나는 심었고 아볼로는 물을 주었으되 오직 하나님께서 자라나게 하셨나니 그런즉 심는 이나 물 주는 이는 아무것도 아니로되 오직 자라게 하시는 이는 하나님뿐이니라",
        verse:"고린도전서 3:6-7"
    }, {
        bible:"하나님이 지으신 그 모든 것을 보시니 보시기에 심히 좋았더라 저녁이 되고 아침이 되니 이는 여섯째 날이니라",
        verse:"창세기 1:31"
    }, {
        bible:"울며 씨를 뿌리러 나가는 자는 반드시 기쁨으로 그 곡식 단을 가지고 돌아오리로다",
        verse:"시편 126:6"
    }, {
        bible:"오늘 다윗의 동네에 너희를 위하여 구주가 나셨으니 곧 그리스도 주시니라",
        verse:"누가복음 2:11"
    }
]

const buttons = document.querySelectorAll(".btn");
const btn1 = document.querySelectorAll("#btn1");
const closeBtn = document.querySelector(".close_btn");
const modal = document.querySelector("#modal");
const nowDate = document.querySelector(".nowDate");
const bible = document.querySelector(".bible");
const verse = document.querySelector(".verse");
const merry = document.querySelector(".merry");
const xmas = document.querySelector(".xmas");
const link = document.querySelector(".link_url");
let n;


function openModal() {
    if (n == 25) {
        merry.innerText = "Merry";
        xmas.innerText = "Chirstmas!";
    }
    nowDate.innerText = `12월 ${n}일`;
    bible.innerText = bibleList[n-1].bible;
    verse.innerText = bibleList[n-1].verse;

    modal.style.display = "flex";
}

function closeModal() {
    modal.style.display = "none";
}

window.onclick = function (e) {
    if (e.target == modal) {
        closeModal();
    }
}

buttons.forEach((btn) => {
    btn.addEventListener("click", function(e) {
        n = Number(e.target.id);
        openModal();
    });
}); 

function copyUrl() {
    const url = window.location.href;

    navigator.clipboard.writeText(url).then(() => {
        alert("                     URL이 복사되었습니다.\n             크리스마스의 설렘을 나눠보세요! 🖤");
    })
}

link.addEventListener("click", copyUrl);
closeBtn.addEventListener("click", closeModal);